In [1]:
import mysql.connector as conn

In [2]:
mydb = conn.connect(host= "localhost",database="customer",user="root", passwd="password", use_pure=True)
# Creating Table
query = "CREATE TABLE workers (id INT NOT NULL AUTO_INCREMENT,"\
"EmpID int(10), FirstName varchar(20),"\
"LastName varchar(20), Department varchar(30), salary int(20), EmailID varchar(30),Joining DATE),PRIMARY KEY (id)"
cur = mydb.cursor()
# cur.execute("insert into workers values(201, 'Ankit', 'Kumar', 'IT',12000,'ankit@gmail.com','2014-03-13')")

 #create a cursor to execute queries
cur.execute(query)
print("Table Created!!")

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ',PRIMARY KEY (id)' at line 1

In [12]:
mydb = conn.connect(host= "localhost",database="customer",user="root", passwd="password", use_pure=True)
cur = mydb.cursor()

In [4]:
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(201, 'Priya', 'Tawer', 'IT','12000','priya@gmail.com','2014-03-12')")

In [7]:
 #create a cursor to execute queries


cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(202, 'Dinesh', 'Kumar', 'HR','42000','abcd@gmail.com','2014-04-14')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(203, 'Krish', 'Meena', 'Sales','32000','krish@gmail.com','2014-02-03')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(204, 'Viskash', 'Vyas', 'HR','22000','afdgd@gmail.com','2014-05-02')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(205, 'Dinesh', 'Bhati', 'Accounts','12000','dinesh@gmail.com','2015-09-19')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(206, 'Harjinder', 'Kaur', 'Finance','19000','harkakd@gmail.com','2021-03-15')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(207, 'Bharti', 'Saini', 'Sales','10000','bharti@gmail.com','2017-07-018')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(208, 'Amitabh', 'Singh', 'Accounts','50000','amitabh@gmail.com','2018-04-14')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(209, 'Sumit', 'Thakur', 'Finance','45000','sumit@gmail.com','2020-04-15')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(211, 'Pawan', 'Meena', 'Medical','42000','pawan@gmail.com','2020-12-15')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(210, 'kanha', 'Taak', 'Medical','32000','kanha@gmail.com','2014-01-21')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(212, 'Divya', 'Singh', 'IT','30000','divya@gmail.com','2016-05-16')")
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(213, 'Pardeep', 'Kumar', 'Sales','20000','fldslf12gmail.com','2015-03-17')")

In [13]:
cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(215, 'Maanveer', 'singh', 'Admin','20000','veer@gmail.com','2014-02-17')")

In [15]:

cur.execute("insert into workers (EmpID, FirstName,LastName, Department, salary, EmailID,Joining) values(219, 'Sumit', 'Thakur', 'Finance','45000','sumit@gmail.com','2020-04-15')")

In [16]:
mydb.commit()

# Assignment_1

### Customer Data
<img src="img/customerdata.jpg" width="700"/>

#### Q-1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as <WORKER_NAME>.

    SELECT FirstName AS worker_name From worker
<img src="img/A1-1.jpg" width="700"/>
    
#### Q-2. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

    SELECT DISTINCT Deparment FROM worker
<img src="img/A1-2.jpg" width="700"/>

#### Q-3. Write an SQL query to show the last 5 record from a table.

    (SELECT * FROM worker ORDER BY EmpID DESC LIMIT 5) ORDER BY EmpID ASC
<img src="img/A1-3.jpg" width="700"/>

# Assignment_2

#### Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

     SELECT SUBSTRING(FirstName,1,3) FROM worker
     
<img src="img/A2-1.jpg" width="700"/>
        
#### Q-2. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.
    SELECT POSITION("A" IN FirstName) FROM worker WHERE FirstName="Amitabh"
    SELECT POSITION("a" IN FirstName) FROM worker WHERE FirstName="Amitabh"
* Both Query will give the same result boz it will take first iter
    
<img src="img/A2-2.jpg" width="700"/>

#### # Q-3. Write an SQL query to print the name of employees having the highest salary in each department.

    SELECT Department, MAX(salary) FROM worker GROUP BY Department
<img src="img/a2-3.jpg" width="700"/>

# Assignment_3

#### Q-1. Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.

            SELECT RTRIM(FirstName) FROM worker
<img src="img/a31.jpg" width="700"/>

#### Q-2. Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.

        SELECT DISTINCT Department, LENGTH(Department) AS DPLength FROM worker
 <img src="img/a32.jpg" width="700"/>

#### Q-3. Write an SQL query to fetch nth max salaries from a table.

    SELECT MAX(salary) FROM worker
 <img src="img/a33.jpg" width="700"/>

# Assignment_4

##### Q-1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.

        SELECT REPLACE(FirstName,"a","A") AS NewName FROM worker
 <img src="img/a41.jpg" width="700"/>

##### Q-2. Write an SQL query to print all Worker details from the Worker table order by FIRST_NAME Ascending and DEPARTMENT Descending.

    SELECT * FROM worker ORDER BY(FirstName) ASC, Department DESC 
  <img src="img/a42.jpg" width="700"/>

##### Q-3. Write an SQL query to fetch the names of workers who earn the highest salary.
  
      SELECT FirstName, salary FROM worker WHERE salary = (SELECT MAX(salary),FORM worker)

 <img src="img/a43.jpg" width="700"/>

# Assignment_5
##### Q-1. Write an SQL query to print details of workers excluding first names, “Vipul” and “Satish” from Worker table.

<img src="img/51.jpg" width="700"/>

##### Q-2. Write an SQL query to print details of the Workers whose FIRST_NAME ends with ‘h’ and contains six alphabets.

        SELECT * FROM worker WHERE FirstName LIKE '______h%'
 <img src="img/a52.jpg" width="700"/>

##### Q-3. Write a query to validate Email of Employee.
    insert into worker values('Predeep', 'Kumar', 'Sales','30000','dsfsdfsdfgmail.com','222')")
    
<img src="img/invalidemail.jpg" width="700"/>

        SELECT * FROM worker WHERE EmailID LIKE '%@%.___%'
        
<img src="img/53.jpg" width="700"/>

# Assingnment_6

###### Q-1. Write an SQL query to print details of the Workers who have joined in Feb’2014.


    SELECT * FORM workers WHERE YEAR(joining) = 2014 AND MONTH(joining)=02


<img src="img/61.jpg" width="700"/>

###### Q-2. Write an SQL query to fetch duplicate records having matching data in some fields of a table.


<img src="img/duplicate.jpg" width="700"/>

    SELECT FirstName, EmailID, COUNT(*) FROM worker GROUP BY FirstName, EmailID, HAVING COUNT(*) > 1

<img src="img/62.jpg" width="700"/>

###### Q-3. How to remove duplicate rows from Employees table.

workers table with duplicate record...
    
   <img src="img/dupre.jpg" width="700"/>

    select *, count(*) as duplicatecount from workers group by FirstName,EmailID;

<img src="img/63.jpg" width="700"/>

we can see table has record where FirstName and EmailID was two time was repeted after execute the query its Deleted...

# Assignment_7
###### Q-13. Write an SQL query to show only odd rows from a table.
 
     SELECT * FROM workers WHERE MOD(id,2)<>0

<img src="img/71.jpg" width="700"/>

###### Q-14. Write an SQL query to clone a new table from another table.

    create table workerclone like workers
    INSERT INTO workerclone SELECT * FROM workers
* we can use both first query will create same table formate that we have and 2nd is insert data into newly table...

* Below query will create table as well do the inerstion operation into newly created table...
        CREATE TABLE cloneworker SELECT * FROM workers;

<img src="img/72.jpg" width="700"/>

# Assignment_8
###### Q-15. Write an SQL query to fetch intersecting records of two tables.

    Considering the following two table
##### workers is as follows

<img src="img/firsttable.jpg" width="700"/>

##### details is as follows

<img src="img/2ndtable.jpg" width="700"/>

Now, let us join these two tables in our SELECT statement as follows.

    SELECT w.EmpID, d.EmpID, w.FirstName,w.EmailID, d.address, d.age FROM workers w
      JOIN details d ON w.EmpID = d.EmpID 
      
This would produce the following result.

<img src="img/82.jpg" width="700"/>



###### Q-16. Write an SQL query to show records from one table that another table does not have.

For this query we have same table which was we have above 
    
        SELECT * FROM workers WHERE NOT EXISTS (SELECT * FROM details WHERE workers.EmpID = details.EmpID)
        
   <img src="img/82a.jpg" width="700"/>

# Assignment_9

######  Q-17. Write an SQL query to show the top n (say 10) records of a table.

    select * from workers order by salary desc limit 10;

<img src="img/91.jpg" width="700"/>

###### Q-18. Write an SQL query to determine the nth (say n=5) highest salary from a table.

    select * from workers order by salary desc limit 5,1;

<img src="img/92.jpg" width="700"/>

# Assignment_10

###### Q-19. Write an SQL query to determine the 5th highest salary without using TOP or limit method.

    SELECT EmpID, FirstName, salary FROM workers w WHERE 6-1 = (SELECT COUNT(DISTINCT salary) FROM workers w2 WHERE w2.salary >= w.salary)

<img src="img/101.jpg" width="700"/>

###### Q-20. Write an SQL query to fetch the list of employees with the same salary.

    select distinct w.FirstName,w.EmailID, w.salary from workers w, workers w1 where w.salary = w1.salary and w.FirstName != w1.FirstName;

<img src="img/102.jpg" width="700"/>